Revit 2026 API

# FamilyInstanceCreationData Properties

---

The FamilyInstanceCreationData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Axis | Get or set the axis of the FamilyInstance |
|  | RotateAngle | Get or set the rotate angle of the FamilyInstance |

#### Reference

FamilyInstanceCreationData Class

Autodesk.Revit.Creation Namespace